Revit 2026 API

# RailingTypeSecondaryHandrailLateralOffset Property

---

The lateral offset of the secondary handrail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SecondaryHandrailLateralOffset { get; }
```
```vb
Public ReadOnly Property SecondaryHandrailLateralOffset As Double
	Get
```
```cpp
public:
property double SecondaryHandrailLateralOffset {
	double get ();
}
```
```fsharp
member SecondaryHandrailLateralOffset : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The rail has no secondary hand rail. |

#### Reference

RailingType Class

Autodesk.Revit.DB.Architecture Namespace